<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

class CreateMoviesTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        $movies = [
            [
                'title' => 'Спокута',
                'image' => 'https://kinoafisha.ua/upload/films/1695/130190148916.jpg',
                'rating' => '8.0',
                'originalTitle' => 'Atonement (original title)',
                'duration' => '2г 3хв',
                'year' => '2007',
                'isPopular' => 'true',
                'description' => "Дія відбувається в Англії наприкінці 1930-х років. Тринадцятирічна Брайоні має багату уяву, пише п'єси й хоче стати письменницею. Її старша сестра Сесилія й син прислуги Роббі таємно закохані одне в одного. Дівчинка стає свідком низки курйозних подій за участю Роббі й Сесилії, і витлумачивши все по-своєму, вирішує, що Роббі є сексуальним маніяком, що переслідує її сестру. Тому коли на території їхнього маєтку її п'ятнадцятирічну кузину Лолу в темряві ґвалтує невідомий чоловік, вона вказує на Роббі — хоч вона й не бачила обличчя злочинця, її уява домальовує картину цього випадку, (насправді ж це зробив зовсім інший чоловік). Хлопець потрапляє до в'язниці, і між Сесилією та її родичами, зокрема Брайоні, починається ворожнеча. Потім дія переноситься на три з половиною років вперед, коли почалася друга світова війна, і Роббі з в'язниці забрали до армії.",

                'moments' => [],
                'actorIds' => [1, 2, 3, 4]
            ],
            [
                'title' => 'Шлюбна історія',
                'image' => 'https://bigmouthbobs.files.wordpress.com/2019/12/marriage-story.jpg?w=640',
                'rating' => '7.5',
                'originalTitle' => 'Marriage Story (original title)',
                'duration' => '2г 17хв',
                'year' => '2019',
                'isPopular' => 'true',
                'description' => "Подружжя — нью-йоркський театральний режисер Чарлі і актриса його театру Ніколь — знаходяться в процесі розлучення. Чарлі все влаштовувало в їхньому шлюбі, але Ніколь вважає, що втратила себе, і, забравши сина, переїжджає до мами в Лос-Анджелес. Там їй вже запропонували роль в серіалі і порадили висококласного адвоката по розлученнях. Тепер Чарлі теж доведеться шукати адвоката, а також розриватися між західним і східним узбережжями, щоб продовжувати працювати і проводити час з сином.",

                'moments' => [],
                'actorIds' => [5, 6, 7, 8]
            ],
            [
                'title' => 'Ножі наголо',
                'image' => 'https://i.pinimg.com/originals/09/74/f6/0974f6a431d81464f0549ebd0d549608.jpg',
                'rating' => '7.9',
                'originalTitle' => 'Knives Out (original title)',
                'duration' => '2г 10хв',
                'year' => '2019',
                'isPopular' => 'true',
                'description' => "Відомий автор кримінальних романів Харлан Тромбі святкує свій 85-й день народження. На свято в маєток письменника зібралася вся родина. Варто сказати, що це далеко не найприємніші особистості, кожен із яких ненавидить один одного. На наступний же день після цієї знаменної події Харлана знаходять мертвим у його особняку. Підозрювані, звичайно ж, є всі його рідні, а також його колишній персонал. Розслідувати цю справу взявся харизматичний і неймовірно допитливий детектив Бенуа Блан. Його чекає, напевно, найбільш заплутана справа в його кар'єрі, адже кожна людина в особняку могла вбити письменника. І всі вони такі неприємні, що краще би нікому не довіряти.",

                'moments' => [],
                'actorIds' => [9, 10, 11, 12]
            ],
            [
                'title' => 'Погані хлопці',
                'image' => 'https://imgc.allpostersimages.com/img/posters/bad-boys-for-life_u-L-F9JL5Y0.jpg',
                'rating' => '6.6',
                'originalTitle' => 'Bad boys for life (original title)',
                'duration' => '2г 4хв',
                'year' => '2020',
                'isPopular' => 'false',
                'description' => "Напарники по службі в поліції Маямі Майк Лоурі та Маркус Бернетт разом розкрили чимало справ і зловили не одного поганого хлопця. Але Маркус втомився, він уже хоче на пенсію або хоча би змінити місце роботи, вік уже не той. Чоловік вирішив, що буде приватним детективом, ця посада спокійніша, ніж постійна стрілянина. Майку ж дали нову команду молодих і зухвалих поліцейських, яких ще вчити та вчити... Але нудно йому не буде точно, адже його хоче вбити албанський найманець заради помсти за свого брата. Тільки одне могло змусити напарників об'єднатися знову – небезпека життів один одного. Це їх остання справа, заради якої хлопці повинні забути старі образи.",

                'moments' => [],
                'actorIds' => [13, 14, 15, 16]
            ],
            [
                'title' => 'Зелена книга',
                'image' => 'https://i.pinimg.com/originals/53/bc/20/53bc202e12b8d658929883c2b4b98473.jpg',
                'rating' => '7.7',
                'originalTitle' => 'Green Book (original title)',
                'duration' => '1г 46хв',
                'year' => '2018',
                'isPopular' => 'false',
                'description' => "У 1962 році викидайла італо-американського походження Тоні Валлелонга на прізвисько «Тоні Балакун» наймають шофером на час туру відомого афроамериканського джазового піаніста Дона Ширлі. За угодою, Тоні отримає повний обсяг гонорару у тому випадку, якщо Дон вчасно прибуде і відіграє усі заплановані концерти. Усі, окрім останнього відбулись, однак Дон сам вирішив не виступати для публіки, що забороняє йому їсти разом з ними. Абсолютно різні, вони разом подорожують провінційним півднем США. Дорогою вони користуються так званою «Зеленою книгою негритянського автомобіліста» Віктора Г'юґо Ґріна, що містить інформацію про безпечні місця для афроамериканців. Ця подорож розкриє їм очі на багато речей, що відбуваються у світі навколо них.",

                'moments' => [],
                'actorIds' => [17, 18, 19]
            ],
            [
                'title' => 'Щоденник Памяті',
                'image' => 'https://i.pinimg.com/originals/cc/0e/0a/cc0e0a8601671c81c55ad9138c81ea62.jpg',
                'rating' => '7.8',
                'originalTitle' => 'NoteBook (original title)',
                'duration' => '2г 10хв',
                'year' => '2018',
                'isPopular' => 'false',
                'description' => "Романтична історія любові сільського хлопця та дівчини з міста, які зустрічаються одного літа, ще в дні своєї юності. Саме цього літа вони закохуються одне в одного. Але батьки Еллі проти кохання їхньої єдиної дочки з сільським хлопцем та розлучають їх. Літо закінчується і Еллі від'їжджає додому, до міста. А Ной залишається у Сібруці та щодня пише їй по одному листу. Але Еллі не отримує жодного листа, оскільки її мати перехоплює листи та ховає їх.",

                'moments' => [],
                'actorIds' => [20, 21, 22, 23]
            ],
            [
                'title' => 'До зустрічі з тобою',
                'image' => 'https://m.media-amazon.com/images/M/MV5BMTQ2NjE4NDE2NV5BMl5BanBnXkFtZTgwOTcwNDE5NzE@._V1_.jpg',
                'rating' => '7.4',
                'originalTitle' => 'Me before You (original title)',
                'duration' => '1г 46хв',
                'year' => '2016',
                'isPopular' => 'false',
                'description' => "Луїза знає, скільки кроків від зупинки до її будинку і що, найпевніше, вона не кохає свого парубка. Але навіть не уявляє, як зустріч із чоловіком, прикутим до інвалідного візка, може змінити її життя... Вілл розуміє, що після аварії завжди відчуватиме біль і власну неповноцінність, і певен, як покласти цьому край. Але навіть не здогадується про те, що у його дім увірветься вихор кольорів, радість і кохання на ім'я Лу.",

                'moments' => [],
                'actorIds' => [24, 25, 26, 27]
            ],
            [
                'title' => 'Близкість',
                'image' => 'https://images-na.ssl-images-amazon.com/images/I/51U8Zp3bAiL._AC_.jpg',
                'rating' => '7.2',
                'originalTitle' => 'Closer (original title)',
                'duration' => '1г 50хв',
                'year' => '2004',
                'isPopular' => 'false',
                'description' => "Ігноруючи пішохідний перехід, Еліс (Портман) тупотить на протилежний бік дороги навпростець проїжджою частиною та потрапляє під колеса. Випадковий свідок події, письменник-невдаха Ден (Лоу) везе безбаштову дівицю до лікаря, але не тільки зі шляхетності — Еліс занадто гарна, щоб згаяти шанс познайомитися ближче. Що продовжилося й після візиту в лікарню спілкування пари виявилася досить плідним: до цього Ден, що заробляв на життя твором некрологів, написав книгу. Джерелом натхнення й прообразом героїні стала його співмешканка — Еліс, якій літератор цілий рік зберігав вірність. Денові, після знайомства з експресивним фотографом Ганною (Робертс), починають лізти в голову думки про плюси розмаїтості але флірт, про який недоречно стає відомо й Еліс, так нічим і не закінчується. Заради дотепу Ден знайомить Ганну з Ларрі (Оуен) — і незабаром любовний трикутник перетворюється на квадрат.",

                'moments' => [],
                'actorIds' => [28, 29, 30, 31]
            ],
            [
                'title' => "З любов'ю, Саймон",
                'image' => 'https://lostfilm.info/images/poster/547/5469864.jpg',
                'rating' => '7.6',
                'originalTitle' => 'Love Simon (original title)',
                'duration' => '1г 50хв',
                'year' => '2018',
                'isPopular' => 'false',
                'description' => "Старшокласник Саймон приховує від друзів свою гомосексуальність, але його листування з анонімним коханим потрапляє в чужі руки. Шкільний «клоун» Мартін загрожує викрити Саймона, якщо той не допоможе йому зав'язати роман з місцевою красунею.",

                'moments' => [],
                'actorIds' => [32, 33, 34, 35]
            ],
            [
                'title' => 'Керол',
                'image' => 'http://sonrazuma.ru/pics/films/c/carol/carol_poster.jpg',
                'rating' => '7.2',
                'originalTitle' => 'Carol (original title)',
                'duration' => '1г 30хв',
                'year' => '2015',
                'isPopular' => 'true',
                'description' => "Нью-Йорк, 1952 рік. Дизайнер Тереза Беліве (Руні Мара) працює в універмазі, куди одного дня заглянула Керол Ейрд (Кейт Бланшетт) у пошуках різдвяного подарунка для своєї доньки. Тереза зачарована цією жінкою і починає усюди йти за Керол, чиє життя домогосподарки з передмістя таке ж рутинне, як і робота Терези. Жінки закохуються одна в одну і незабаром вирушають у подорож Сполученими Штатами, але чоловік Керол посилає за ними приватного детектива. Керол має зробити вибір між своєю донькою і коханою.",

                'moments' => [],
                'actorIds' => [36, 37, 38, 39]
            ],
            [
                'title' => 'Магія місячного сяйва',
                'image' => 'https://kinanema.net/_ld/35/3565.jpg',
                'rating' => '6.5',
                'originalTitle' => 'Magic in the moonlight (original title)',
                'duration' => '1г 37хв',
                'year' => '2014',
                'isPopular' => 'true',
                'description' => "Стенлі Кроуфорд — відомий англійський ілюзіоніст, який під псевдонімом Вей Лін Су гастролює по всій Європі з успішними виставами. На прохання свого друга і колеги Говарда Беркена (Саймон Макберні) він вирушає до Франції, щоб викрити молоду американку Софі Бейкер (Емма Стоун), аферистку, яка за допомогою спіритичних сеансів завоювала довіру багатого сімейства.",
                'moments' => [],
                'actorIds' => [40, 41, 42, 43]
            ],
            [
                'title' => 'Пара на свята',
                'image' => 'https://kino-teatr.ua/public/main/films/2020-10/poster_5f7b04112e63a.jpg',
                'rating' => '6.1',
                'originalTitle' => 'Holidate (original title)',
                'duration' => '1г 44хв',
                'year' => '2020',
                'isPopular' => 'true',
                'description' => " Слоан і Джексон ненавидять свята. Вони постійно опиняються під час свят одні, за дитячим столом або на незручному побаченні всліпу, яке підготували для них родичі. Але коли ці два незнайомця знайомляться на одному дуже поганому Різдві, вони укладають договір про те, щоб бути «святковими плюс один» один для одного на кожному торжестві протягом наступного року. Їх взаємна нелюбов до свят і впевненість в тому, що їх абсолютно не тягне один до одного в романтичному плані, роблять Слоан і Джексона ідеальною парою на празники. Але у кохання свої плани щодо цієї парочки.",

                'moments' => [],
                'actorIds' => [44, 45, 46, 47]
            ],
            [
                'title' => 'Зависнути у Палм-Спрінгз',
                'image' => 'https://www.kino-teatr.ru/movie/poster/140940/100478.jpg',
                'rating' => '7.4',
                'originalTitle' => 'Palm Springs (original title)',
                'duration' => '1г 30хв',
                'year' => '2020',
                'isPopular' => 'true',
                'description' => "Найлз прокидається 9 листопада зі своєю подругою Місті в день весілля Тали і Ейба. Під час церемонії Найлз виступає з промовою, допомагаючи тим самим сестрі Тали Сарі. Найлз і Сара проводять час разом і, після того як вони виявляють, що Місті зраджує Найлзу, збираються зайнятися сексом. В цей час літній чоловік на ім'я Рой стріляє в Найлза з лука. Поранений Niles повзе до печери, що знаходиться неподалік, і попереджає Сару, щоб вона не йшла за ним. Тим не менш, Сара заходить в печеру і потрапляє у вихор. Сара прокидається і розуміє, що сьогодні знову 9 листопада. Вона зустрічається з Найлзом, який пояснює їй, що вона потрапила у часову петлю і він не знає, як з неї вибратися.",

                'moments' => [],
                'actorIds' => [48, 49, 50, 51]
            ],
            [
                'title' => 'Фріда',
                'image' => 'https://static.kino.de/wp-content/uploads/2015/08/frida-2002-filmplakat-rcm300x428u.jpg',
                'rating' => '7.4',
                'originalTitle' => 'Frida (original title)',
                'duration' => '2г 3хв',
                'year' => '2002',
                'isPopular' => 'false',
                'description' => "Стрічка розповідає про непросте життя мексиканської художниці Фріди Кало. Молода дівчина потрапляє у аварію, де зазнає численних травм і переломів, через що виявляється загіпсованою і прикутою до ліжка, а потім до кінця життя страждає від болю. Під час хвороби Фріда починає писати картини. Одужавши, вона показує їх відомому художнику Дієго Рівері, який згодом стає її вчителем, чоловіком і соратником у політичній боротьбі. Її кар'єра розвивається,вона знайомиться з видатними людьми, зокрема Троцьким, Рокфеллером та іншими. Врешті-решт художниця вже на смертному одрі домагається відкриття власної виставки на батьківщині.",

                'moments' => [],
                'actorIds' => [52, 53, 54]
            ],
            [
                'title' => 'Гордість і упередження',
                'image' => 'https://upload.wikimedia.org/wikipedia/uk/9/90/Pride-and-prejudice2005.jpg',
                'rating' => '8',
                'originalTitle' => 'Pride and Prejudice',
                'duration' => '2г 9хв',
                'year' => '2005',
                'isPopular' => 'false',
                'description' => "У центрі оповідання — небагата родина Беннетів, що складається з пана й пані Беннет та їхніх п'ятьох дочок — Джейн, Елізабет (Ліззі), Мері, Кетрин (Китті) і Лідії. Вони живуть на фермі у селі Лонгборн. Однак спадкоємцем цієї ферми є двоюрідний брат дівчат, племінник Беннета — пан Коллінз. Тому головною метою життя пані Беннет є скоріше й вдаліше видати заміж дочок — перш, ніж помре пан Беннет. Друга за віком дочка й головна героїня фільму, розумна та вільнодумна Елізабет, вірить, що шлюб повинен засновуватися тільки на справжньому коханні — і тому не квапиться вийти заміж.",

                'moments' => [],
                'actorIds' => [1, 71, 72]
            ]
        ];


        Schema::create('movies', function (Blueprint $table) {
            $table->id();
            $table->string('title');
            $table->text('description');
            $table->string('originalTitle');
            $table->string('duration');
            $table->string('year');
            $table->string('image');
            $table->timestamps();
        });

        foreach ($movies as $movie) {
            App\Models\Movie::create($movie);
        }
    }


    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('movies');
    }
}
